{
    "sports": [
      {
        "id": 1,
        "name": "Adidas Predator Soccer Ball",
        "brand": "Adidas",
        "category": "Team Sports",
        "price": 34.99,
        "currency": "USD",
        "stock": 150,
        "rating": 4.8,
        "reviews": 720,
        "discount": 10,
        "sport_type": "Soccer",
        "size": "Size 5",
        "material": "Synthetic Leather",
        "features": ["Durable Construction", "Water-Resistant", "Official Match Ball"],
        "warranty": "6 Months",
        "description": "The Adidas Predator Soccer Ball is designed for players who demand precision and durability. Constructed with high-quality synthetic leather, this ball provides excellent grip and control during matches. Its water-resistant feature ensures that you can play in any weather conditions without compromising performance. Whether you're practicing your shots or playing an intense match, this ball delivers optimal performance and longevity. Perfect for training and official games, it offers an authentic playing experience with enhanced durability and air retention.",
        "images": [
          "https://example.com/images/adidas_soccer_ball1.jpg",
          "https://example.com/images/adidas_soccer_ball2.jpg"
        ]
      },
      {
        "id": 2,
        "name": "Wilson NBA Official Basketball",
        "brand": "Wilson",
        "category": "Team Sports",
        "price": 59.99,
        "currency": "USD",
        "stock": 100,
        "rating": 4.9,
        "reviews": 1050,
        "discount": 15,
        "sport_type": "Basketball",
        "size": "Size 7",
        "material": "Composite Leather",
        "features": ["Official NBA Ball", "Grip Control", "Indoor & Outdoor Use"],
        "warranty": "1 Year",
        "description": "The Wilson NBA Official Basketball is a top-tier ball used by professional players and enthusiasts alike. Engineered with composite leather, it provides superior grip and excellent control, allowing players to execute precise dribbles and shots. Designed for both indoor and outdoor use, this ball retains its durability and maintains a consistent bounce. Its moisture-wicking surface prevents slipping, ensuring that players maintain a firm grip even in high-pressure situations. Whether you’re practicing or competing, this basketball guarantees top-notch performance.",
        "images": [
          "https://example.com/images/wilson_nba_ball1.jpg",
          "https://example.com/images/wilson_nba_ball2.jpg"
        ]
      },
      {
        "id": 3,
        "name": "Yonex Carbonex 8000 Plus Badminton Racket",
        "brand": "Yonex",
        "category": "Racquet Sports",
        "price": 79.99,
        "currency": "USD",
        "stock": 80,
        "rating": 4.7,
        "reviews": 500,
        "discount": 10,
        "sport_type": "Badminton",
        "weight": "85g",
        "material": "Graphite & Carbon Fiber",
        "features": ["Lightweight Design", "High Tension Strings", "Shock Absorption"],
        "warranty": "6 Months",
        "description": "The Yonex Carbonex 8000 Plus Badminton Racket is designed for players looking to improve their performance with a lightweight yet powerful racket. Made from high-quality graphite and carbon fiber, this racket delivers excellent power while maintaining exceptional control. The shock-absorbing technology reduces vibrations, making every shot smooth and precise. The aerodynamic frame enhances swing speed, allowing for quicker responses in competitive matches. Whether you are a beginner or an advanced player, this racket will enhance your gameplay with its balance of power, speed, and precision.",
        "images": [
          "https://example.com/images/yonex_racket1.jpg",
          "https://example.com/images/yonex_racket2.jpg"
        ]
      },
      {
        "id": 4,
        "name": "Nike Men's Running Shoes",
        "brand": "Nike",
        "category": "Athletic Wear",
        "price": 129.99,
        "currency": "USD",
        "stock": 200,
        "rating": 4.9,
        "reviews": 1350,
        "discount": 20,
        "sport_type": "Running",
        "size_range": "7-12 (US)",
        "material": "Mesh & Rubber",
        "features": ["Breathable Material", "Cushioned Sole", "Slip-Resistant"],
        "warranty": "1 Year",
        "description": "Designed for both casual runners and professional athletes, Nike's Men's Running Shoes provide superior comfort and support. The breathable mesh upper keeps your feet cool, while the cushioned sole absorbs impact, reducing stress on joints. A slip-resistant outsole enhances traction, making them perfect for both track and road running. The lightweight design ensures agility and speed, allowing runners to push their limits with confidence. Whether training for a marathon or going for a casual jog, these shoes offer a perfect blend of style, performance, and durability.",
        "images": [
          "https://example.com/images/nike_running_shoes1.jpg",
          "https://example.com/images/nike_running_shoes2.jpg"
        ]
      },
      {
        "id": 5,
        "name": "Everlast Heavy Boxing Bag",
        "brand": "Everlast",
        "category": "Fitness & Training",
        "price": 89.99,
        "currency": "USD",
        "stock": 70,
        "rating": 4.8,
        "reviews": 600,
        "discount": 12,
        "sport_type": "Boxing",
        "weight": "100 lbs",
        "material": "Synthetic Leather",
        "features": ["Durable Construction", "Reinforced Straps", "Shock Absorbing"],
        "warranty": "1 Year",
        "description": "Train like a professional fighter with the Everlast Heavy Boxing Bag. Designed for high-intensity workouts, this heavy bag is built with durable synthetic leather that withstands powerful punches and kicks. The reinforced straps ensure secure hanging, while the shock-absorbing material reduces impact strain on the hands and wrists. Whether you’re practicing striking techniques or working on endurance, this bag is perfect for home and gym use. Elevate your boxing and martial arts training with this high-quality punching bag from Everlast.",
        "images": [
          "https://example.com/images/everlast_boxing_bag1.jpg",
          "https://example.com/images/everlast_boxing_bag2.jpg"
        ]
      }
    ]
  }
  